/*题目描述
当然网速快还不行.MSH发现电影竟然被加密.无奈的MSH只好找到站长SGQ。讯问密码是多少.SGQ告诉他这个可是一个动态密码.并且是由一个游戏而得出的.游戏如下:在长度为n米的线段上,坐标为0代表左端点，坐标为n代表右端点.一开始有两个不计体积小球(不计体积.即一个坐标可以容纳两个小球，在碰撞前)A,B分别在坐标x和y上( x != y).已知它们相撞或者到达右端点或者左端点即改变自己移动方向(朝左端点方向改为右端点方向.右端点方向改为左端点方向).两个小球移动速度始终保持1米/S.初始方向都朝右端点。经过t秒后.小球A,B的坐标即为密码.
输入格式
输入的第一行包含四个整数n,x,y,t( 1<=n<=1,000,000 , 0<x<y<n, 1<=t<=10,000,000 )分别代表线段长度，小球A的坐标，小球B的坐标和经过的秒数t.
输出格式
输出密码(即小球A和小球B坐标)
样例输入
10 2 5 3
样例输出
58
提示
小球A经过3s到达坐标5(2+3 = 5).因为没有到达右端点和左端点或者与小球B碰撞.所以一直朝右端点移动了3个单位.
小球B经过3s到达坐标8(5+3 = 8).因为没有到达右端点和左端点或者与小球A碰撞.所以一直朝右端点移动了3个单位.
*/

#include <cstdio>
#include <iostream>
using namespace std;

int main()
{
    int n , x , y , t , Va = 1 , Vb = 1;
    scanf("%d %d %d %d",&n,&x,&y,&t);
    for (int i = 0 ; i < t ; i ++)
    {

        if ( x == y )
        {
            Va = - Va;
            Vb = - Vb;
        }
        else if ( x == 0 || x == n )
        {
            Va = - Va;
        }
        else if ( y == 0 || y == n )
        {
            Vb = - Vb;
        }
        x = x + Va;
        y = y + Vb;
    }
    if ( x > y )
    {
        swap( x , y );
    }
    printf("%d%d",x,y);
    return 0;
}